Repository: Mohammad-Alshawi/wazzifni-backend
Catalog: src/Wazzifni.Core/Localization/SourceFiles/Exceptions.*.resx
Languages: ar, ku

source: Attribute data type does not match input
ar: نوع قيمة الإدخال غير متوتفقة مع نوع قيمة الخاصية

# AttributeValueIsAlreadyExist
source: Your attribute value has previous value
ar: قيمة الخاصية موجودة مسبقاً

# BrokerContactEmptyForRecoverBrokerUser
source: This broker cannot be restored because its contact numbers have been permanently deleted.
ar: لا يمكن استعادة هذا المكتب لأنه قد تم حذف ارقام تواصله بشكل دائم

# BrokerIsNotApprove
source: Broker Is Not In Approve Status Please Wait for admin approval
ar: المكتب ليس في حالة قبول من فضلك انتظر موافقة الأدمن

# CannotDeleteDueToReservationsUndeProcessing
source: It is not possible to delete because there are reservations under processing. Please close the reservation status and try again later
ar: لا يمكن الحذف بسبب وجود حجوزات تحت المعالجة يرجى اغلاق حالة الحجوزات ثم المحاولة لاحقا

# CannotUpdateThisPropertyDueToReservations
source: You cannot edit some information for this property due to existing or future confirmed reservations.
ar: لا يمكنك تعديل بعض معلومات هذا العقار نظرًا لوجود حجوزات مؤكدة قائمة أو مستقبلية.

# CantDeleteThisRequestNotClosed
source: You cannot delete this request because it is in a {0} state.
ar: لا تسطيع حذف هذا الطلب لأنه بحالة {0}.

# ContributionExist
source: This contribution already exists for the specified tower.
ar: هذه المساهمة موجودة بالفعل للبرج المحدد.

source: File Size Exceeds Max File Size
ar: حجم الملف يتجاوز الحد الأقصى لحجم الملف المقبول
ku: قەبارەی پەڕگە لە سەر دەچێت لە سنووری پەڕگەی قبوڵکراو

# FileSizeSupported
source: File Size Supported In MegaByte
ar: حجم الملف المقبول بالميغا بايت
ku: قەبارەی پەڕگەی قبوڵکراو بە مێگابایت

source: Incompatible Value
ar: قيمة غير متوافقة
ku: نرخی ناگونجاو

# InvalidDedlineToConfirmReservation
source: The deadline for confirming your reservation must be specified in hours and minutes
ar: يجب تحديد الموعد النهائي لتأكيد الحجز بالساعات و الدقائق

# LogInFirst
source: You Need to Login First
ar: يجب عليك تسجيل الدخول أولاً
ku: پێویستە سەرەتا بچیتە ژوورەوە

# LowResolutionVideo
source: Your Video has a Very Low Quality. Try to Upload another Video with better Quality.
ar: دقة الفيديو ضعيفة جداً. حاول رفع فيديو آخر بدقة أفضل

# NoReservationFeatureWithThisCategory
source: There is no reservation feature with this category
ar: لا توجد خاصية الحجز مع هذه الفئة

# NoReservationFeatureWithThisProperty
source: There is no reservation feature with this property
ar: لا توجد خاصية الحجز مع هذا الاعلان

# ObjectCantBeDeactivate
source: Cant be deactivate It has related {0}
ar: لايمكن الغاء تفعليه لانه مرتبط {0}
ku: ناتوانرێت ناچالاک بکرێت چونکە بەستراوەتەوە. {0}

# ObjectCantBeDelete
source: Cant be delete it has related {0}
ar: لايمكن حذفه لانه مرتبط {0}
ku: ناتوانرێت بسڕدرێتەوە چونکە بەستراوەتەوە. {0}

# ObjectIsAlreadyExist
source: {0} Is Already Exist
ar: {0} موجود مسبقا
ku: {0} لە ئێستاوە بوونیان هەیە

# ObjectWasNotFound
source: {0} Not Found
ar: {0} غير موجود
ku: {0} نەدۆزرایەوە

source: Property Is Not For Rent
ar: الاعلان ليس للايجار

# ReachedMaximumNumberAllowed
source: You have reached the maximum number allowed.
ar: وصلت إلى العدد الأقصى المسموح للإضافة

# ReservationDatesBeyondAllowedLastDate
source: The reservation includes dates that are beyond the allowed last date for reservations.
ar: يتضمن الحجز تواريخ تتجاوز الموعد الأخير المسموح به للحجز.

# ReservationIncludesAnotherReservationDates
source: The reservation includes other reservation dates that are still under processing
ar: الحجز يشمل مواعيد حجز أخر ما زال تحت المعالجة

# ReservationIncludesPastOrCurrentDate
source: The reservation includes dates that are in the past or today, which are not allowed.
ar: يتضمن الحجز تواريخ في الماضي أو اليوم، وهي غير مسموح بها.

# ReservationIncludesUnavailableDates
source: The reservation includes dates that are not available for booking.
ar: يشمل الحجز تواريخ غير متاحة للحجز.

# SignUpNotComplete
source: Your signingup information not correct
ar: معلومات التسجيل غير صحيحة
ku: زانیاری ناو تۆمارکردن هەڵەیە.

source: The Attached File Type Is Not Acceptable
ar: نوع الملف غير مقبول

source: The phone number is already in use
ar: رقم الهاتف مستخدم بالفعل
ku: ژمارەی تەلەفۆن پێشتر بەکارهاتووە

source: The request has not selected a service provider
ar: لم يحدد الطلب مزود الخدمة

source: This Position Is Already Exist
ar: هذا الموقع موجود بالفعل
ku: ئەم شوێنە پێشتر هەیە

# UserCanotPuplish
source: The broker has exhausted his publishing balance or does not have a bundle
ar: الوسيط استنفذ رصيده في النشر او لا يملك باقة

# UserNameTakenForRecoverBrokerUser
source: Sorry, the user cannot be retrieved because there is an existing user with the same username.
ar: عذرا لا يمكن استرجاع المستخدم لأنه يوجد مستخدم حالي بنفس اسم المستخدم
ku: ببورە، بەکارهێنەرەکە ناتوانرێت وەربگیرێتەوە چونکە بەکارهێنەرێکی هەبوو هەیە بە هەمان ناوی بەکارهێنەر.

# UserNotFoundPleasCreateNewAccount
source: User not found. Please create an account with your phone number.
ar: المستخدم غير موجود. يُرجى إنشاء حساب باستخدام رقم الموبايل.
ku: بەکارهێنەر بوونی نییە. تکایە بە بەکارهێنانی ژمارەی مۆبایل ئەکاونتێک دروست بکەن.

source: Verification code is expired.
ar: انتهت صلاحية كود التحقق
ku: کۆدی پشتڕاستکردنەوە بەسەرچووە

# VerificationCodeIsnotCorrect
source: Verification code isn't correct
ar: رمز التحقق غير صحيح
ku: کۆدی پشتڕاستکردنەوە نادروستە

# VerificationCodeIsnotValid
source: Verification code Isn't valid
ar: رمز التحقق غير صالح
ku: کۆدی پشتڕاستکردنەوەی نادروست

# VideoTagsNumberIsAboveMaximum
source: The Video Can Not be Attached to more than {0} Tags
ar: لا يمكن أن يرتبط الفيديو بأكثر من {0} علامة

# YouCannotDoThisAction
source: You can't do this action
ar: لا يمكنك القيام بهذا الإجراء
ku: ناتوانیت ئەم کردارە بکەیت

# YouCannotDoThisAnymore
source: Sorry, you have exhausted the specified number of publishing possibilities
ar: عذراً لقد استنفذت عدد امكانية النشر المحدد

# YouCannotDoThisAnymoreWithPostsChecking
source: You have exceeded the number of posts allowed. You currently have a number of posts under review, in addition to the number of posts you have published. Please wait for your current posts to be reviewed before publishing more.
ar: تجاوزت عدد المنشورات المسموح به . لديك حالياً عدد من المنشورات قيد المراجعة، بالإضافة إلى عدد المنشورات التي قمت بنشرها يرجى انتظار الانتهاء من مراجعة منشوراتك الحالية قبل نشر المزيد.

# YourPhoneNumberIsntVerified
source: Your phone number is not verified
ar: لم يتم التحقق من رقم هاتفك
ku: ژمارەی تەلەفۆنت پشتڕاست نەکراوە
